package exercise;

/*
	올바른 괄호
	
	괄호가 바르게 짝지어졌다는 것은 '(' 문자로 열렸으면 반드시 짝지어서 ')' 문자로 닫혀야 한다는 뜻입니다.
	예를 들어
	"()()" 또는 "(())()" 는 올바른 괄호입니다.
	")()(" 또는 "(()(" 는 올바르지 않은 괄호입니다.
	'(' 또는 ')' 로만 이루어진 문자열 s가 주어졌을 때,
	문자열 s가 올바른 괄호이면 true를 return 하고, 올바르지 않은 괄호이면 false를 return 하는 solution 함수를 완성해 주세요.
	
	제한사항
	문자열 s의 길이 : 100,000 이하의 자연수
	문자열 s는 '(' 또는 ')' 로만 이루어져 있습니다.
	
	입출력 예
	s	answer
	"()()"	true
	"(())()"	true
	")()("	false
	"(()("	false
*/

public class Exercise31 {
	boolean solution(String s) {
		if(s.charAt(0) == ')' || s.charAt(s.length()-1) == '(') {
			return false;
		}
				
		int count = 0;
		
		for(int i = 0; i < s.length(); i++) {
			if(s.charAt(i) == '(') {
				count++;
			}else {
				count--;
			}
			
			if(count < 0) {
				return false;
			}
		}
		
		if(count == 0) {
			return true;
		}       
        
        return false;
    }
}

/*
	정확성  테스트
	테스트 1 〉	통과 (0.01ms, 75.3MB)
	테스트 2 〉	통과 (0.02ms, 78.8MB)
	테스트 3 〉	통과 (0.03ms, 76.9MB)
	테스트 4 〉	통과 (0.02ms, 75.8MB)
	테스트 5 〉	통과 (0.03ms, 69.8MB)
	테스트 6 〉	통과 (0.02ms, 73.7MB)
	테스트 7 〉	통과 (0.02ms, 71.7MB)
	테스트 8 〉	통과 (0.03ms, 70.7MB)
	테스트 9 〉	통과 (0.03ms, 72.5MB)
	테스트 10 〉	통과 (0.04ms, 68.1MB)
	테스트 11 〉	통과 (0.03ms, 73.9MB)
	테스트 12 〉	통과 (0.04ms, 78.6MB)
	테스트 13 〉	통과 (0.03ms, 73.9MB)
	테스트 14 〉	통과 (0.02ms, 76.6MB)
	테스트 15 〉	통과 (0.03ms, 73.1MB)
	테스트 16 〉	통과 (0.03ms, 77.6MB)
	테스트 17 〉	통과 (0.02ms, 77.7MB)
	테스트 18 〉	통과 (0.01ms, 71MB)
	
	효율성  테스트
	테스트 1 〉	통과 (6.08ms, 52.2MB)
	테스트 2 〉	통과 (5.90ms, 52.7MB)
	
	채점 결과
	정확성: 69.5
	효율성: 30.5
	합계: 100.0 / 100.0
*/